# Pandas Overview

Pandas is a library built ontop of NumPy for ease of working with data, visualization, and loading data

## Series Overview

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
myData = [10, 20, 30]
arr = np.array(myData)
d = {'a': 10, 'b': 20, 'c': 30}

Creating the series

In [3]:
pd.Series(data = myData)
# 0 1 and 2 are the indices and then the data
# We can specify what we want those indices to be in Pandas' Series

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data = myData, index = labels)
# Note the indices have changed from 1:3 to a:c

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(myData, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [8]:
# Using a dictionary to set an array organizes by key and values
print(d)
pd.Series(d)

{'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [9]:
# Series can hold (most) any type of data type as an object
pd.Series(labels)
# Note this data is strings

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data = [sum, print, len])
# Note that it can even hold built in functions as data points
# This isn't very useful, but it's something to see it can do

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Key to using a series is using the indices

In [11]:
ser1 = pd.Series(list(np.arange(1,5)), ['USA', 'Germany', 'USSR', 'Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [13]:
# Selecting the value at the index
# A string is used as the index as the data type for the labels is a string
ser1['USA']

1

In [14]:
ser3 = pd.Series(data = labels)
ser3

0    a
1    b
2    c
dtype: object

In [15]:
# An instance of using an integer
ser3[0]

'a'

In [16]:
# Series operations work off of indices
ser1 + ser2
# Note that when the label is not present in both series, we receive NAN
# Note that integers are converted to floats

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Dataframes

Data frames are 'the true work horse of Pandas'

In [17]:
# Still have pandas and numpy imported as pd and np
from numpy.random import randn
np.random.seed(101) # Set to 101 based on lecture

In [18]:
# Recall tab can autocomplete/intellisense and shift + tab gives us the docstring
df = pd.DataFrame(data = randn(5,4), index = ['A', 'B', 'C', 'D', 'E'], columns = ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Each column is a Pandas Series, but all share a common indice

A dataframe may best be described as a group of series sharing an index

In [19]:
# Return only a column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
print(type(df['W']))
print(type(df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [21]:
# Similar to SQL
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

Bracket notation is prefered so as not to mess up the methods associated with the dataframe command

In [22]:
# Return multiple series/columns: input a list
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
# Create a new column
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df.drop('new')
# Note the error refers to the axes = 0, let's change it to axis = 1 (column)

KeyError: "['new'] not found in axis"

In [25]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
# Though this does not affect the initial dataframe, to do so,
# you must set inplace to True
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [27]:
df.drop('new', axis = 1, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# We can also drop rows
df.drop('E')
# Remember axis is default to 0, rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [29]:
# Find the dimension of the dataframe
df.shape

(5, 4)

In [30]:
# Selecting Rows
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
# Selecting rows by  location: index 'label', not numerical index
print(df.loc['A'])
print(type(df.loc['A']))
# Note that the columns and rows are both series

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64
<class 'pandas.core.series.Series'>

In [32]:
# Selecting rows by index location: numerical index, not 'label'
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
# Selecting subsets of rows and columns
df.loc['B', 'Y']
# Use the comma notation

-0.8480769834036315

In [34]:
df.loc[['A','B'], ['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Conditional Selection with Pandas DataFrames

In [35]:
np.random.seed(101) # Set to 101 based on lecture
df = pd.DataFrame(data = randn(5,4), index = ['A', 'B', 'C', 'D', 'E'], columns = ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# Returns boolean DataFrame
booldf = df > 0

In [37]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [41]:
df[df['W']>0]
# Null/NAN values only appear when you use the comparison operator on
# the entire DataFrame
# Doing the condition on a column, you will only return the relevant
# series

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

 ### Conditional Selection

In [42]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [43]:
booldf = df > 0
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
# More common is to pass a row or column value for selection
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [46]:
df[df['W'] > 0]
# Note how this does not return row 'C'
# For df['W'] > 0, row 'C' returned False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['Z'] < 0]
# note that column 'Z' is less than zero only at row 'C'

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
# Note that this conditional selection is returning a DataFrame
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
resultdf['X']
# Notice now that in resultdf, there is no row 'C', so this returns
# a DataFrame without it

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [50]:
# Now, let's do the selection all in one step
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [51]:
# Return selections of numerous columns instead of just one
df[df['W'] > 0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [52]:
boolser = df['W'] >0
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [53]:
result = df[boolser]
result
myCols = ['Y','X']
result[myCols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [54]:
# Multiple condition Selection
# Using the AND / & Operator
df[(df['W']>0) and (df['Y']>1)]
# Error based on truth value, can't use Python's and operator as it
# can't take into account a series of boolean operators, only one at
# a time.
#
# USE & INSTEAD

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [55]:
print(df)
df[(df['W']>0) & (df['Y']>1)]
# Note that only row 'E' is true for this

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [56]:
# Using the OR / | operator
df[(df['W']>0) | (df['Y']>1)]
# Can't use Python's 'or' operator because of the same reason you
# can't use the 'and' operator

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

#### Working with indices

In [57]:
# Reset the index from A:E with default values (0:...)
df.reset_index()
# Note that it adds the old index in as a column, but it also
# doesn't occur inplace

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [58]:
# See how there was no change? inplace was not set to True
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
newind = ' CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [60]:
# Adding to a DataFrame
df['States'] = newind

In [61]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [62]:
# Make a column the index
df.set_index('States')
# Again, this is not inplace

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-index and Index Hierarchy

In [63]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # combines pairs into tuples
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [64]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [65]:
inside

[1, 2, 3, 1, 2, 3]

In [66]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [67]:
df = pd.DataFrame(randn(6,2),hier_index, ['A','B'])
df
# This has an index hierarchy

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [68]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [69]:
df.loc['G1'].loc[1]
# Start from the outside, G1, and move inward, to G1 1 which returns
# the data in columns A and B from G1 1

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [70]:
# We can give these cells name
df.index.names

FrozenList([None, None])

In [71]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [72]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [73]:
df.loc['G1'].loc[2]

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [74]:
# No change
np.transpose(df.loc['G1'].loc[2])

A   -1.706086
B   -1.159119
Name: 2, dtype: float64

In [75]:
df.loc['G1'].loc[:]['B']

Num
1    1.693723
2   -1.159119
3    0.390528
Name: B, dtype: float64

In [76]:
# Cross Sectioning - Can skip or go inside a multilevel index
df.loc['G1']

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [77]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [78]:
# Say I want all values where the inside index is equal to one
df.xs(1,level = 'Num')
# Notice it pulled from both groups

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

In [79]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [80]:
# Drop missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [81]:
# REMEMBER INPLACE!
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [82]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [83]:
# Thresh hold setting
df.dropna()
# drops everything

     A    B  C
0  1.0  5.0  1

In [84]:
df.dropna(thresh = 2)
# Kept the second row because it only had 2 missing values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [85]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [86]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [87]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### GroupBy

Groupby allows you to group together rows based off of a column and perform aggregate functions on them

In [88]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [89]:
# grouping by the company column and operating
df.groupby('Company')
# Displays where the object is stored in memory

In [90]:
byComp = df.groupby('Company')
byComp

In [91]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [92]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [93]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [94]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [95]:
# Putting it together in one line
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [96]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [97]:
df.groupby('Company').max()
# Sorts on strings alphabet when data is a string

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [98]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [99]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [100]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging, Joining, and concatenating

In [101]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [102]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [103]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [104]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [105]:
# Note the indice differences
pd.concat([df1,df2,df3])
# Dimensions should match up

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [107]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [108]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [109]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### Merging

In [110]:
pd.merge(left,right, how = 'inner', on = 'key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

More complex

In [111]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [112]:
pd.merge(left, right, on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [113]:
pd.merge(left, right, how = 'outer', on = ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [114]:
pd.merge(right, left, how = 'outer', on = ['key1', 'key2'])

  key1 key2    C    D    A    B
0   K0   K0   C0   D0   A0   B0
1   K1   K0   C1   D1   A2   B2
2   K1   K0   C2   D2   A2   B2
3   K2   K0   C3   D3  NaN  NaN
4   K0   K1  NaN  NaN   A1   B1
5   K2   K1  NaN  NaN   A3   B3

In [115]:
pd.merge(left, right, how = 'right', on = ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [116]:
pd.merge(left, right, how = 'left', on = ['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining

In [117]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [118]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [119]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [120]:
left.join(right, how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

## Operations in Pandas

In [121]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [122]:
# Returning unique values
df['col2'].unique()

array([444, 555, 666])

In [123]:
# Count the number of unique values
print(len(df['col2'].unique()))
# Here is a pandas built-in method - nunique()
df['col2'].nunique()

3

3

In [124]:
# Table of the unique values and their frequency
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [125]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [126]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [127]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [128]:
df[df['col2'] == 444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

### Using functions on DataFrames - the .apply() method

In [129]:
def times2(x):
    return x * 2

In [130]:
df['col1'].sum()

10

In [131]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [132]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

You can also use lambda experessions instead of defining an entirely new function

In [133]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [134]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [135]:
df
# REMEMBER INPLACE

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [136]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [137]:
df.index

RangeIndex(start=0, stop=4, step=1)

### Sorting

In [138]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [139]:
df.sort_values(by = 'col2', axis = 0)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Finding null values

In [140]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [141]:
df.isnull()
# all falses becuase there are no null type values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [142]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### Pivot Tables

In [143]:
df.pivot_table(values = 'D', index = ['A', 'B'])

           D
A   B
bar one  2.5
    two  5.0
foo one  2.0
    two  2.0

In [144]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output

Pandas can take in files like:
    
    * CSV
    * Excel
    * HTML
    * SQL
    
You must install:
    
    conda install sqlalchemy lxml html5lib BeautifulSoup4

In [145]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [146]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [147]:
df.to_csv('MyOutput.csv', index = False)

In [148]:
pd.read_csv('MyOutput.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [149]:
# Reading and writing excel files
# Reading and writing with Macros can make things fail
#
# Pandas treats sheets in excel files as data from
pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [150]:
df.to_excel('ExcelSample2.xlsx')

### HTML Input

In [151]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
# find table 
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 21, 2018"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","July 26, 2017"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","December 5, 2017"

Pandas may not be the best way to use SQL because of how many different flavors of SQL engine exist

In [155]:
from sqlalchemy import create_engine

In [156]:
engine = create_engine('sqlite://', echo=False)

In [158]:
df.to_sql('myData', engine)

AttributeError: 'list' object has no attribute 'to_sql'

In [159]:
sqldf = pd.read_sql('myData', con = engine)

OperationalError: (sqlite3.OperationalError) near "myData": syntax error [SQL: 'myData'] (Background on this error at: http://sqlalche.me/e/e3q8)